feat/2026-08-29-jvm-gc-curriculum
